АвтосервисАвтомагазин/src/DataProcessors/КА2_УправлениеНаборомМоделейДляНоменклатуры/КА2_УправлениеНаборомМоделейДляНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КА2_УправлениеНаборомМоделейДляНоменклатуры</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючиМоделей</name>
    <attributes>
      <name>ТипТС</name>
      <type>
        <types>CatalogRef.КА2_Типы</types>
      </type>
    </attributes>
    <attributes>
      <name>Совместимо</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МаркаНаименование</name>
      <type>
        <types>CatalogRef.КА2_НаименованияМарок</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.КА2_Марки</types>
      </type>
    </attributes>
    <attributes>
      <name>МодельНаименование</name>
      <type>
        <types>CatalogRef.КА2_НаименованияМоделей</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.КА2_Модели</types>
      </type>
    </attributes>
    <attributes>
      <name>Поколение</name>
      <type>
        <types>CatalogRef.КА2_Поколения</types>
      </type>
    </attributes>
    <attributes>
      <name>ГодыВыпуска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодНП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кузов</name>
      <type>
        <types>CatalogRef.КА2_Кузова</types>
      </type>
    </attributes>
    <attributes>
      <name>КузовНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модификация</name>
      <type>
        <types>CatalogRef.КА2_Модификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>CatalogRef.КА2_Комплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоколениеКузов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АвтосервисАвтомагазин/src/Catalogs/КА2_КлючиМоделей/КА2_КлючиМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КА2_КлючиМоделей</name>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>CatalogRef.КА2_Типы</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.КА2_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КА2_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Поколение</name>
    <type>
      <types>CatalogRef.КА2_Поколения</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузов</name>
    <type>
      <types>CatalogRef.КА2_Кузова</types>
    </type>
  </attributes>
  <attributes>
    <name>Модификация</name>
    <type>
      <types>CatalogRef.КА2_Модификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектация</name>
    <type>
      <types>CatalogRef.КА2_Комплектации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоколениеКузов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АвтосервисАвтомагазин/src/DataProcessors/КА2_УправлениеНаборомМоделейДляНоменклатуры/Forms/ДляОтбораСписка/Module.bsl
// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	СчетчикИспользования = СчетчикИспользования + 1;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	Объект.КлючиМоделей.Очистить();

	МассивКлючиМоделей = Настройки.Получить("КлючиМоделей");

	Если МассивКлючиМоделей <> Неопределено Тогда
		Для Каждого Стр Из МассивКлючиМоделей Цикл
			НовСтр = Объект.КлючиМоделей.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)

	МассивПустыеПоля = ПараметрыСеанса.КА2_КлючиМоделейПустыеПоля;

	ДляСтруктуры = Новый Массив;
	РазделительПолей = ", ";

	Для Каждого Элемент Из МассивПустыеПоля Цикл
		ДляСтруктуры.Добавить(Элемент.ИмяПоля);
	КонецЦикла;

	КлючиСтруктуры = СтрСоединить(ДляСтруктуры, РазделительПолей);

	МассивКлючиМоделей = Новый Массив;

	Для Каждого Стр Из Объект.КлючиМоделей Цикл
		СтрСтр = Новый Структура(КлючиСтруктуры);
		ЗаполнитьЗначенияСвойств(СтрСтр, Стр);
		МассивКлючиМоделей.Добавить(СтрСтр);
	КонецЦикла;

	Настройки.Вставить("КлючиМоделей", МассивКлючиМоделей);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлючиМоделей

&НаКлиенте
Процедура ПоколениеКузовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.КлючиМоделей.ТекущиеДанные;

	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("Марка", ТекущиеДанные.МаркаНаименование);
	ПараметрыВызова.Вставить("Модель", ТекущиеДанные.МодельНаименование);

	ОткрытьФорму("Справочник.КА2_КлючиМоделей.Форма.ФормаВыбора",
				 ПараметрыВызова,
				 Элементы.ПоколениеКузов,
				 ЭтаФорма.УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПоколениеКузовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ЗаполнитьЗначенияСвойств(Элементы.КлючиМоделей.ТекущиеДанные, ВыбранноеЗначение);

	Элемент = ВыбранноеЗначение.ПоколениеКузов;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьИУстановитьОтбор(Команда)

	МассивОтбора = КА2_КаталогАвтомобилейВызовСервера.МассивОтбора(Объект.КлючиМоделей, РасширенныйРежим = 1);
	СтрокаВНаименование = КА2_КаталогАвтомобилейКлиентСервер.СформироватьСтрокуВНаименование(Объект.КлючиМоделей);

	ЭтотОбъект.ВладелецФормы.АвтоЗаголовок = Ложь;
	ЭтотОбъект.ВладелецФормы.Заголовок = "Номенклатура - для " + СтрокаВНаименование;

	КА2_ФильтрКлиентСервер.УстановитьОтборПоМоделиАвтомобиля(ЭтотОбъект.ВладелецФормы, МассивОтбора);

	ЭтотОбъект.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБезУстановкиОтбора(Команда)

	ИмяКомандыОчистки = "ОчиститьТЧ";

	Если Команда.Имя = ИмяКомандыОчистки Тогда
		Объект.КлючиМоделей.Очистить();
	КонецЕсли;

	КА2_ФильтрКлиентСервер.ОчиститьОтборПоМоделиАвтомобиля(ЭтотОбъект.ВладелецФормы);
	ЭтотОбъект.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура КлючиМоделейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Совместимо = Истина;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
